Repository: SanjaykumarIOS/AfriSure-
Catalog: AfriSure/LanguageLocalized/*.lproj/Localizable.strings
Languages: am

source: KenIndia
am: ኬንኢንዲያ

source: Nyala
am: ኒያላ

source: Sign in
am: ግባ

source: Select your Organisation
am: የምህዳርያስተምር ይምረጡ

source: Email
am: ኢሜይል

source: Enter your Email
am: ኢሜይልውን ያስገቡ

source: Password
am: ፓስወርድ

source: Enter your Password
am: ፓስወርድዎን ያስገቡ

source: LOGIN
am: ግባ

source: Forgot your password?
am: ፓስወርድዎን ለማረጋገጥ?

source: Don't have an account?
am: አካውንት የለውም?

source: SIGN UP
am: ይመዝገቡ

source: Hello Saranya,
am: ሰላም Saranya,

source: Line of Business
am: በኢንሹራንስ ሂደት

source: View more
am: ተጨማሪ ይመልከቱ

source: Get Quotes
am: ዋጋ ይሁኑ

source: Home
am: መነሻ

source: My Quotation
am: የጥቅል ቋንቋዎች

source: Notifications
am: ማሳወቂያዎች

source: Account
am: መለያ

source: Settings
am: ቅንብሮች

source: Your session has been expired. Please login again to continue
am: የእርስዎ ክፍለ ጊዜ ጊዜው አልፎበታል። ለመቀጠል እባክዎ እንደገና ይግቡ

source: Logout
am: ውጣ

source: Are you sure you want to logout?
am: እርግጠኛ ነህ መውጣት ትፈልጋለህ?

source: Yes
am: አዎ

source: No
am: አይ

source: Search
am: ፈልግ

source: Products
am: ንግድ

source: NEXT
am: ቀጣይ

source: To personalize your insurance policy, we'd love to know more about you.
am: አሁንም እንዲህ በመጠበቅ እኛን እንዲሆን እናስቀም የአስራሪነትን ፖሊሲኒል መረጃ የሚገኘውን መረጃ የተጠቃሚውን ይፈጥራል።

source: Customer Type*
am: የተጠቃሚ አይነት*

source: Full Name
am: ሙሉ ስም

source: Phone Number
am: ስልክ ቁጥር

source: Email Address
am: ኢሜል አድራሻ

source: User Information
am: ተጠቃሚ መረጃ

source: Quotation ID
am: ዋጋ መለያ

source: Done
am: እሺ

source: Custom Forms
am: ሥርዓቶች በግልጽ

source: OK
am: እሺ

source: Compare
am: መተንተን

source: Total Premium
am: አጠቃላይ ዋጋ

source: Selected
am: ተመርጧል

source: Select
am: ምረጥ

source: View Checklist
am: ክፍለ-በጎችን ይመልከቱ

source: No Checklist Available
am: የምረጥዋን ክፍለ-በጎ የለም

source: Based on the criteria you have selected, this product is not eligible for you.
am: በሚጠቅምለት ቅደም ላይ በተመረጠው ውጤት ይመልከቱ። ይህ ንግድ ይታየዋል።

source: INSTALLMENTS
am: ክፍያዎች

source: BREAK-DOWN
am: የተመረጠ ክፍል

source: Quotation
am: ዋጋ

source: Compare Quotations
am: ዋጋዎችን መተንተን

source: Check List
am: ክፍለ-በግ

source: Quotation Installments
am: ዋጋ ክፍያዎች

source: S.No
am: ማስታወሻ ቀን

source: Installment Period
am: ክፍያ በጊዜ

source: Amount
am: ብዛት

source: Quotation Break-Down
am: ዋጋን የተመረጠ ክፍል

source: Premium Category
am: ከፋይ ካቶሊክ

source: Total
am: አጠቃላይ

source: PROCEED TO BUY
am: ለማግኘት ቀጥል

source: Compare products
am: የምግብ ንግድን መተንተን

source: Please select only two products for comparison.
am: እባክዎ ለማነፃፀር ሁለት ምርቶችን ብቻ ይምረጡ።

source: User Name
am: የተጠቃሚ ስም

source: Created On
am: በፊት ተከታይ ቀን

source: Policy Type
am: ፖለሲ አይነት

source: Account Number
am: መለያ ቁጥር

source: Expiry Date
am: በምሳሌ ቀን

source: Quotation List
am: ዋጋ ዝርዝር

source: Please select your organisation to continue!
am: እባክዎ ለመቀጠል ድርጅትዎን ይምረጡ!

source: Please enter your email address to continue!
am: እባክዎ ለመቀጠል የኢሜል አድራሻዎን ያስገቡ!

source: Please enter valid email address to continue!
am: እባክዎ ለመቀጠል ትክክለኛ የኢሜይል አድራሻ ያስገቡ!

source: Please enter your password to continue!
am: እባክዎ ለመቀጠል የይለፍ ቃልዎን ያስገቡ!

source: Please enter your full name to continue!
am: እባክዎ ለመቀጠል ሙሉ ስምዎን ያስገቡ!

source: Please enter your phone number to continue!
am: እባክዎ ለመቀጠል ስልክ ቁጥርዎን ያስገቡ!

source: Please enter your valid phone number to continue!
am: እባክዎ ለመቀጠል ትክክለኛ ስልክ ቁጥርዎን ያስገቡ!

source: Please select adjustment type to continue!
am: እባክዎ ለመቀጠል የማስተካከያ አይነት ይምረጡ!

source: Please select risk category to continue!
am: እባክዎ ለመቀጠል የአደጋ ምድብ ይምረጡ!

source: Please enter amount to continue!
am: እባክዎ ለመቀጠል መጠኑን ያስገቡ!

source: Amount value cannot be 0.
am: የመጠን ዋጋ 0 ሊሆን አይችልም።

source: Amount exceeds the maximum limit of
am: መጠን ከከፍተኛው ገደብ አልፏል

source: Please enter comments to continue!
am: እባክዎ ለመቀጠል አስተያየቶችን ያስገቡ!

source: Something went wrong
am: የሆነ ስህተት ተከስቷል

source: Customer Type is required
am: የደንበኛ አይነት ያስፈልጋል

source: Either Customer ID or Customer Name is required
am: የደንበኛ መታወቂያ ወይም የደንበኛ ስም ያስፈልጋል

source: Please select the customer
am: እባክዎ ደንበኛን ይምረጡ

source: Server Error: Oops! Something went wrong on our end. Our servers are experiencing technical difficulties. We apologize for the inconvenience. Please try again later.
am: የአገልጋይ ስህተት፡ ውይ! በእኛ በኩል የሆነ ችግር ተፈጥሯል። አገልጋዮቻችን የቴክኒክ ችግሮች እያጋጠማቸው ነው። ለተፈጠረው ችግር ይቅርታ እንጠይቃለን። እባክህ ቆይተህ እንደገና ሞክር።
